【打开拉取请求】
现在你已在从 main 创建的分支中进行了更改，接下来可打开拉取请求。

拉取请求是 GitHub 上协作的核心。 打开拉取请求后，可以提出更改，要求某人审查和提取您的贡献并将其
合并到其分支中。 拉取请求显示两个分支中内容的差异。 变化、增减以不同的颜色显示。

只要进行提交，便可打开拉取请求并开始讨论，即使在代码完成之前亦可。

通过在拉取请求消息中使用 GitHub 的 @mention 功能，可向特定人员或团队请求反馈，无论他们近在大厅还是远在 10 个时区之外。

您甚至可以在自己的存储库中打开拉取请求并自行合并。 这是在处理大型项目之前了解 GitHub 流程的好方法。

1 单击 hello-world 存储库的“拉取请求”选项卡。
2 单击“新建拉取请求”
3 在“示例比较”框中，选择你创建的分支 readme-edits，与 main（原始分支）进行比较。
4 在 Compare（比较）页面上的差异中查看您的更改，确保它们是您要提交的内容。
[差异示例]
5 单击“创建拉取请求”。
6 为拉取请求指定一个标题，并写下更改的简要说明。 您可以包含表情符号以及拖放图像和 gif。
7 （可选）在标题和说明右侧，单击“审阅者”旁边的 。 单击“代理人”、“标签”、“项目”或“里程碑”，将这些选项的任何一个添加到拉取请求 。 您不需要添加任何内容，但这些选项提供了使用拉取请求进行协作的不同方式。 有关详细信息，请参阅“关于拉取请求”。
8 单击“创建拉取请求”。
您的协作者现在可以查看您的编辑内容并提出建议。

【合并拉取请求】
在最后一步中，你将 readme-edits 分支合并到 main 分支中。 合并拉取请求后，readme-edits 分支上的更改将合并到 main。

有时，拉取请求可能会引入与 main 上的现有代码冲突的代码更改。 如果存在任何冲突，GitHub 将提醒您有关冲突代码的信息，并防止合并，直到冲突解决为止。 您可以进行解决冲突的提交，也可以使用拉取请求中的注释与团队成员讨论冲突。

在本演练中，应该没有任何冲突，因此您已准备好将分支合并到主分支中。

1 单击“合并拉取请求”，将更改合并到 main。
“合并”按钮的屏幕截图。
2 单击“确认合并”。 您将收到一条消息，指出请求已成功合并且请求已关闭。
3 单击“删除分支”。 现在你的拉取请求已合并，并且你的更改位于 main 上，接下来你可安全地删除 readme-edits 分支。如果要对项目进行更多更改，可以随时创建新分支并重复此过程。
4 合并完便可以删除分支了，奥利给

本文内容:
简介
创建仓库
创建分支
  创建分支
创建和提交更改
打开拉取请求
合并拉取请求
后续步骤
链接:https://docs.github.com/cn/get-started/quickstart/hello-world


